---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFinish
source: html/74463788-0b39-d594-5e1e-8370d72dcbff.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFinish Property

The property labeled "Finish" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintFinish { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFinishType".